// This query returns the SAMR queries that were successful in the last 5 hours.
// Description: This query returns the SAMR queries that were successful in the last 5 hours.
// Reference: https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4698
// Mitre ATT&CK: T1003.003
IdentityQueryEvents
| where Timestamp >= ago(5h) | order by Timestamp
| where ActionType in ("SAMR query","SamrQuerySuccess")
| join kind=inner (
IdentityDirectoryEvents
| where Timestamp > ago(5h)
) on AccountName
| project Timestamp, ActionType, QueryType, QueryTarget, Protocol