// Kerberos Authentication Failed
// Ref: https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4771
// MITRE ATT&CK: T1552.001
IdentityLogonEvents
| where ActionType == "LogonFailed"
| where Application == "Active Directory"
| where Protocol == "Kerberos"