// Windows - User Password Was Set to Never Expire or Not Required
// Use-Case: Detects when a user's password is set to never expire or not required.
// MITRE ATT&CK: T1201
// MITRE tactics: Credential Access, Defense Evasion, Persistence
IdentityDirectoryEvents
| where ActionType == "Account Password Never Expires changed"
| extend ['Password never expires previous setting'] = tostring(AdditionalFields.["FROM Account Password Never Expires"])
| extend ['Password never expires current setting'] = tostring(AdditionalFields.["TO Account Password Never Expires"])
| project
    TimeGenerated,
    TargetAccountUpn,
    ['Password never expires current setting'],
    ['Password never expires previous setting']
    