// Check Weak Cipher such as Kerberos Authentication 
// Description: This query will help you to identify the weak cipher used in Kerberos Authentication
// Reference: https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4769
// Mitre ATT&CK: T1558.003
IdentityLogonEvents
| where Timestamp >= ago(1d)
| where Protocol == @"Kerberos"
| extend ParsedFields=parse_json(AdditionalFields)
| extend EncryptionType = tostring(ParsedFields.EncryptionType)
| project Timestamp, ActionType, DeviceName, IPAddress, DestinationDeviceName,AccountName, AccountDomain,EncryptionType 
//| summarize count() by AccountName, AccountDomain, EncryptionType