// Title: AWS Macie detection Evasion detection
// Description: Detects AWS Macie detection evasion activities by monitoring the API calls related to Macie
// MITRE: T1107
// MITRE Tactics: Defense Evasion    
// Reference: https://docs.aws.amazon.com/macie/latest/user/findings-filter.html
// Reference: https://cloud.hacktricks.xyz/pentesting-cloud/aws-security/aws-services/aws-security-and-detection-services/aws-macie-enum
AWSCloudTrail
| where EventName in~ (@'ArchiveFindings', @'CreateFindingsFilter', @'DeleteMember', @'DisassociateFromMasterAccount', @'DisassociateMember', @'DisableMacie', @'DisableOrganizationAdminAccount', @'UpdateFindingsFilter', @'UpdateMacieSession', @'UpdateMemberSession', @'UpdateClassificationJob')
| summarize count() by SourceIpAddress, bin(TimeGenerated, 10m)
| top 10 by count_ desc
| project TimeGenerated, SourceIpAddress, count_ 