// Title: A potential creation of specific files in ProgramData - Forest Blizzard
// Description: This query retrieves device file events that match specific folder paths and file names.
// MITRE ATT&CK: T1003.003, T1003.002, T1003.001 
// References: https://www.microsoft.com/en-us/security/blog/2024/04/22/analyzing-forest-blizzards-custom-post-compromise-tool-for-exploiting-cve-2022-38028-to-obtain-credentials
DeviceFileEvents
| where (
     (
          (FolderPath startswith @'C:\ProgramData\Microsoft\v' or FolderPath startswith @'C:\ProgramData\Adobe\v' or FolderPath startswith @'C:\ProgramData\Comms\v' or FolderPath startswith @'C:\ProgramData\Intel\v' or FolderPath startswith @'C:\ProgramData\Kaspersky Lab\v' or FolderPath startswith @'C:\ProgramData\Bitdefender\v' or FolderPath startswith @'C:\ProgramData\ESET\v' or FolderPath startswith @'C:\ProgramData\NVIDIA\v' or FolderPath startswith @'C:\ProgramData\UbiSoft\v' or FolderPath startswith @'C:\ProgramData\Steam\v')
          and (FolderPath contains @'\pnms003.inf_' or FolderPath contains @'\pnms009.inf_')
     )
     or (
          FolderPath startswith @'C:\ProgramData\'
          and (
               (FolderPath endswith @'.save' or FolderPath endswith @'\doit.bat' or FolderPath endswith @'\execute.bat' or FolderPath endswith @'\servtask.bat')
               or (FolderPath contains @'\wayzgoose' and FolderPath endswith @'.dll')
          )
     )
)
| project DeviceName, InitiatingProcessFileName, InitiatingProcessFolderPath, InitiatingProcessCommandLine, FolderPath, FileName, FileOriginUrl, ActionType, ReportId