// Sharpup detection
// Detects the use of SharpUp, a tool for local privilege escalation
// Mitre ATT&CK: T1218
// Reference: https://github.com/GhostPack/SharpUp
DeviceProcessEvents 
| where (FolderPath endswith @'\SharpUp.exe' 
     or InitiatingProcessVersionInfoFileDescription =~ @'SharpUp' 
     or ProcessVersionInfoFileDescription =~ @'SharpUp' 
     or (ProcessCommandLine contains @'HijackablePaths' 
     or ProcessCommandLine contains @'UnquotedServicePath' 
     or ProcessCommandLine contains @'ProcessDLLHijack' 
     or ProcessCommandLine contains @'ModifiableServiceBinaries' 
     or ProcessCommandLine contains @'ModifiableScheduledTask' 
     or ProcessCommandLine contains @'DomainGPPPassword' 
     or ProcessCommandLine contains @'CachedGPPPassword'))