// Detects usage of "cmdkey.exe" to add generic credentials to the Windows Credential Manager
// Description: This query detects the usage of "cmdkey.exe" to add generic credentials to the Windows Credential Manager.
// Reference: https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/cmdkey
// Mitre ATT&CK: T1552.001
DeviceProcessEvents
| where ((FolderPath endswith @'\cmdkey.exe' 
    or ProcessVersionInfoOriginalFileName =~ @'cmdkey.exe') 
    and (ProcessCommandLine contains @' -g' 
    or ProcessCommandLine contains @' /g') 
    and (ProcessCommandLine contains @' -u' 
    or ProcessCommandLine contains @' /u') 
    and (ProcessCommandLine contains @' -p' 
    or ProcessCommandLine contains @' /p'))