// Detects usage of "cmdkey.exe" to add generic credentials to the Windows Credential Manager
// 
DeviceProcessEvents
| where ((FolderPath endswith @'\cmdkey.exe' 
    or ProcessVersionInfoOriginalFileName =~ @'cmdkey.exe') 
    and (ProcessCommandLine contains @' -g' 
    or ProcessCommandLine contains @' /g') 
    and (ProcessCommandLine contains @' -u' 
    or ProcessCommandLine contains @' /u') 
    and (ProcessCommandLine contains @' -p' 
    or ProcessCommandLine contains @' /p'))