// Title: AWS Attached Malicious Lambda Layer
// Description: Detects when an user attached a Lambda layer to an existing function to override a
// MITRE: 1216 
// MITRE Tactics: Defense Evasion   
AWSCloudTrail 
| where (EventSource =~ @'lambda.amazonaws.com' 
    and EventName startswith @'UpdateFunctionConfiguration')