// Potential Storage Enumeration on AWS
// https://unit42.paloaltonetworks.com/compromised-cloud-compute-credentials/

AWSCloudTrail
| where (EventSource =~ @'s3.amazonaws.com' 
    and EventName in~ (@'ListBuckets', @'GetBucketCors', @'GetBucketInventoryConfiguration', @'GetBucketPublicAccessBlock', @'GetBucketMetricsConfiguration',@'GetBucketPolicy', @'GetBucketTagging'))
| summarize count() by SourceIpAddress, bin(TimeGenerated, 15m)


