// Detects when the email sending feature is enabled for an AWS account and the email address verification request is dispatched in quick succession
// https://unit42.paloaltonetworks.com/compromised-cloud-compute-credentials/

AWSCloudTrail
| where TimeGenerated >= ago(31d)
| where (EventSource =~ @'ses.amazonaws.com' 
    and EventName =~ @'UpdateAccountSendingEnabled' 
    and EventName =~ @'VerifyEmailIdentity')