// Title: Potential Network Enumeration on AWS
// Description: Detects potential network enumeration activity on AWS. This query looks for AWS CloudTrail events that are indicative of network enumeration activity. This includes events such as DescribeCarrierGateways, DescribeVpcEndpointConnectionNotifications, DescribeTransitGatewayMulticastDomains, DescribeClientVpnRoutes, DescribeDhcpOptions, and GetTransitGatewayRouteTableAssociations. These events are often used by attackers to gather information about the network configuration of the target environment. This query can be used to detect potential network enumeration activity on AWS.
// MITRE: T1046
// MITRE Tactics: Discovery
// https://unit42.paloaltonetworks.com/compromised-cloud-compute-credentials/
AWSCloudTrail 
| where (EventSource =~ @'ec2.amazonaws.com' 
    and EventName in~ (@'DescribeCarrierGateways', @'DescribeVpcEndpointConnectionNotifications', @'DescribeTransitGatewayMulticastDomains', @'DescribeClientVpnRoutes', @'DescribeDhcpOptions', @'GetTransitGatewayRouteTableAssociations')) 
| summarize count() by EventName, bin(TimeGenerated, 10m) 
| order by TimeGenerated desc
| project TimeGenerated, EventName, count_