// Suspicious PowerShell Download
// Description: This query looks for suspicious PowerShell commands that download files from the internet.
// Reference: https://techcommunity.microsoft.com/t5/microsoft-defender-for-endpoint/hunting-for-evil-script-downloads/ba-p/1169241
// Mitre ATT&CK: T1105 
let suspiciousCommands = dynamic([
     "iex", 
     "New-Object", 
     "Start-Process", 
     "Invoke-Expression", 
     "Invoke-Command", 
     "Invoke-Item"
]);
let suspiciousProcesses = dynamic([
     "powershell.exe", 
     "cmd.exe"
]);
let suspiciousFileExtensions = dynamic([
     ".ps1", 
     ".exe", 
     ".vbs", 
     ".js"
]);
DeviceEvents
| where InitiatingProcessCommandLine has_any (suspiciousCommands) 
    or InitiatingProcessFileName in (suspiciousProcesses)
    or (InitiatingProcessFileName endswith (suspiciousFileExtensions))
| where InitiatingProcessParentFileName <> "SenseIR.exe"   
| summarize count () by InitiatingProcessCommandLine, ActionType, Timestamp, DeviceName, InitiatingProcessFileName, InitiatingProcessAccountDomain
