// Search for malicious HTTP traffic
// This query searches for HTTP traffic that matches the HTTP_Client signature. This signature is triggered when a client sends an HTTP request to a server. The query extracts the HTTP request method and the remote URL from the signature matched content.
// Mitre ATT&CK: T1071
DeviceNetworkEvents
| where TimeGenerated >= ago(15d)
| where ActionType == "NetworkSignatureInspected"
| extend
     SignatureName = tostring(parse_json(AdditionalFields).SignatureName),
     SignatureMatchedContent = tostring(parse_json(AdditionalFields).SignatureMatchedContent),
     SamplePacketContent = tostring(parse_json(AdditionalFields).SamplePacketContent)
| where SignatureName == "HTTP_Client"
| extend HTTP_Request_Method = tostring(split(SignatureMatchedContent, " /", 0)[0])
| project TimeGenerated, DeviceName, DeviceId, ActionType, HTTP_Request_Method, RemoteUrl