// Windows - User Password Was Set to Never Expire or Not Required
// Use-Cases: Detect when a user account is modified to have a password that never expires or is not required.
// MITRE ATT&CK: T1132
DeviceEvents
| where ActionType == "UserAccountModified"
| extend PassNotReq = parse_json(AdditionalFields).UserAccountControl
| where PassNotReq contains PassNotReq