// LDAP Hunting Query with Target
// Description: This query is designed to detect LDAP queries with specific targets and filters.
// Mitre ATT&CK Tactic: Discovery 
let LDAP_Filter = dynamic([
"objectGUID=*",
"(objectClass=*)",
"(schemaIDGUID=*)",
"(samAccountType=805306368)",
"(&(objectclass=computer)(userAccountControl&8192))",
"( | (objectClass=user) (objectClass=group) ) (objectSid=S-1-5-21-1960408961-838170752-1801674531-512) )",
"objectCategory=CN=Organizational-Unit,CN=Schema,CN=Configuration",
"(|(samAccountType=805306368)(samAccountType=805306369)(objectclass=organizationalUnit))",
"(|(samaccounttype=268435456)(samaccounttype=268435457)(samaccounttype=536870912)(samaccounttype=536870913))",
"(objectCategory=computer)(userAccountControl:1.2.840.113556.1.4.803:=8192)"
]);
let LDAP_Target = dynamic([
"Domain Admins",
"Schema Admins",
"Enterprise Admins",
"AllDomains",
"AllTrustDomains",
"AllSites",
"AllGroupPolicies"
]);
IdentityQueryEvents
| where Timestamp >= ago(1d)
| where ActionType == "LDAP query"
| where QueryTarget has_any (LDAP_Target)
| where Query has_any (LDAP_Filter)
//| project Timestamp, InitiatingProcessAccountName, InitiatingProcessCommandLine, InitiatingProcessFolderPath, InitiatingProcessParentAccountName, InitiatingProcessParentCommandLine, InitiatingProcessParentFolderPath, InitiatingProcessParentProcessId, InitiatingProcessProcessId, InitiatingProcessSHA1
