// Check SPNs objects in Active Directory
// MITRE ATT&CK: T1207
// Description: This query returns all the SPN objects in Active Directory.
// The following query returns all the SPN objects in Active Directory.
// It is important to note that the SPN objects are used to uniquely identify an instance of a service.
let SPN = dynamic([
"AcronisAgent",
"AdtServer",
"afpserver",
"AFServer",
"Agent VProRecovery Norton Ghost 12.0",
"AgpmServer",
"aradminsvc",
"Backup Exec System Recovery Agent 6.x",
"BICMS",
"BO3SSO",
"BOCMS",
"BOSSO",
"CAXOsoftEngine",
"CAARCserveRHAEngine",
"CESREMOTE",
"CIFS",
"ckp_pdp",
"CmRcService",
"Cognos",
"CUSESSIONKEYSVR",
"cvs",
"Dfsr-12F9A27C-BF97-4787-9364-D31B6C55EB04",
"DNS",
"DynamicsNAV",
"E3514235-4B06-11D1-AB04-00C04FC2DCD2",
"E3514235-4B06-11D1-AB04-00C04FC2DCD2-ADAM",
"exchangeAB",
"exchangeMDB",
"exchangeRFR",
"EDVR",
"fcsvr",
"FIMService",
"FileRepService",
"ftp",
"flume",
"gateway",
"GC",
"hbase",
"HBase",
"hdb",
"hdfs",
"hive",
"host",
"Hue",
"Hyper-V Replica Service",
"iem",
"IMAP",
"IMAP4",
"impala",
"ImDmsSvc",
"ipp",
"iSCSITarget",
"jboss",
"JournalNode Server",
"kadmin",
"Kafka",
"kudu",
"kafka_mirror_maker",
"krbsvr400",
"ldap",
"LiveState Recovery Agent 6.x",
"magfs",
"mapred",
"M-Files",
"Microsoft Virtual Console Service",
"Microsoft Virtual System Migration Service",
"mongod",
"mongos",
"mr2",
"MSClusterVirtualServer",
"MSCRMAsyncService",
"MSCRMSandboxService",
"MSOLAPDisco.3",
"msolapdisco3",
"MSOLAPSvc",
"MSOLAPSvc.3",
"MSOMHSvc",
"MSOMSdkSvc",
"MSServerCluster",
"MSServerClusterMgmtAPI",
"MSSQL",
"MSSQL$ADOBECONNECT",
"MSSQL$BIZTALK",
"MSSQL$BUSINESSOBJECTS",
"MSSQL$DB01NETIQ",
"MSSQLSvc",
"NAV2016",
"nfs",
"Norskale",
"NPPolicyEvaluator",
"NPRepository4(DEFAULT)",
"NPRepository4(*)",
"NtFrs-88f5d2bd-b646-11d2-a6d3-00c04fc9b232",
"oozie",
"OA60",
"oracle",
"pcast",
"PCNSCLNT",
"PIServer",
"POP",
"POP3",
"PVSSoap",
"postgres",
"RestrictedKrbHost",
"RPC",
"SAP",
"SAPService",
"SAS",
"SCVMM",
"SQLAgent$DB01NETIQ",
"secshd",
"SeapineLicenseSvr",
"sentry",
"sip",
"SMTP",
"SMTPSVC",
"SoftGrid",
"solr",
"spark",
"informatica",
"Storm",
"STS",
"tapinego",
"TERMSERV",
"TERMSRV",
"tnetdgines",
"VCSClusterVirtualServer",
"VMMSvc",
"vmrc",
"vnc",
"VProRecovery Backup Exec System Recovery Agent 7.0",
"VProRecovery Backup Exec System Recovery Agent 8.0",
"VProRecovery Backup Exec System Recovery Agent 8.5",
"VProRecovery Backup Exec System Recovery Agent 9.0",
"VProRecovery Norton Ghost Agent 12.0",
"VProRecovery Norton Ghost Agent 14.0",
"VProRecovery Norton Ghost Agent 15.0",
"VProRecovery Symantec System Recovery Agent 10.0",
"VProRecovery Symantec System Recovery Agent 11.0",
"VProRecovery Symantec System Recovery Agent 11.1",
"VProRecovery Symantec System Recovery Agent 14.0",
"vssrvc",
"WSMAN",
"xgrid",
"xmpp",
"yarn",
"yarn",
"Zeppelin",
"ZooKeeper",
"zookeeper"
]);
CloudAppEvents
| extend Object = tostring(parse_json(RawEventData).ObjectId)
| where Object has_any (SPN)
| summarize count() by Object, ActionType